# 1. Identifying fraudulent claims

You have a project with a new customer who has asked you to find a way to prioritize suspicious claims on the motor line of business, in order to help the investigators of the company on their daily work.

You have already started the project with the customer and after some initial meetings it has been possible to identify what data is needed and what data is available. Finally they have delivered to you the data in a csv file called claims.csv.

# 2. Data

The data that you will find here has the following information

|| |||
| --- ||||
| monthsascustomer | age | policy_number | policybinddate |
| policy_state | policy_csl | policy_deductable | policyannualpremium |
| umbrella_limit | insured_zip | insured_sex | insurededucationlevel |
| insured_occupation | insured_hobbies | insured_relationship | capital-gains |
| capital-loss | incident_date | incident_type | collision_type |
| incident_severity | authorities_contacted | incident_state | incident_city |
| incident_location | incidenthouroftheday | numberofvehicles_involved | property_damage |
| bodily_injuries | witnesses | policereportavailable | totalclaimamount |
| injury_claim | property_claim | vehicle_claim | auto_make |
| auto_model | auto_year | fraud_reported | _c39] |

# 3. Solution

Now is your turn. In the next step you need to develop a prototype with this data and show the customer your results and try to convince them that your model will offer an added value to the company. Good luck!!

---

The target variable is `fraud_reported`, which can assume a value in {0,1}.

The purpose of the model is to prioritize suspicious claims; we expect the target variable to be unbalanced with relatively few frauds. <br/>
Thus, we intend to use logistic regression, to obtain a probability of fraud pâˆˆ[0,1] for each sample.

Before implementing any model, we focus on feature analysis and feature engineering. <br/>
We start by examining the percentage of missing values in each column.

In [1]:
import pandas as pd
from IPython.display import display, Markdown as md

In [2]:
INPUT_FILE = "claims.csv"
df = pd.read_csv(INPUT_FILE)
y_name = "fraud_reported"

### 3.1 Missing values

In [3]:
# What is the percentage of missing values in each column?
total = df.isnull().sum().sort_values(ascending=False)
percent = (df.isnull().sum() / df.isnull().count()).sort_values(ascending=False)
missing_data = pd.concat([total, percent], axis=1, keys=['Total', 'Percent'])
missing_data.head(10)

                             Total  Percent
_c39                           700      1.0
age                              0      0.0
incident_state                   0      0.0
incident_city                    0      0.0
incident_location                0      0.0
incident_hour_of_the_day         0      0.0
number_of_vehicles_involved      0      0.0
property_damage                  0      0.0
bodily_injuries                  0      0.0
witnesses                        0      0.0

We observe that only one column has 100% missing values and can be dropped.

In [4]:
columns_to_drop = (missing_data[missing_data['Total'] > 10]).index
df = df.drop(columns_to_drop, axis=1)

### 3.2 Variable domains

Which values does each column hold? <br/>
We could find 'NA' values equivalent to null values, or columns that contain the same value in 100% of the samples

Number of samples in the dataset : 700 <br/>
For each variable, we display the (max 10) most frequent values in [value, frequency] format:

In [5]:
for c in df.columns:
    vc = df[c].value_counts(ascending=False).iloc[0:10]
    display(pd.DataFrame(vc))

     months_as_customer
289                   6
259                   6
230                   6
210                   6
140                   6
285                   5
107                   5
128                   5
156                   5
245                   5

    age
34   37
43   33
33   32
41   31
39   29
31   29
32   28
30   28
37   27
38   26

        policy_number
125591              1
836349              1
130930              1
413192              1
226725              1
533941              1
349658              1
756870              1
942106              1
432740              1

            policy_bind_date
2002-07-16                 2
1997-02-03                 2
1992-08-05                 2
1995-09-19                 2
2008-05-16                 2
2002-12-28                 2
1991-07-20                 2
1995-12-07                 2
1999-12-07                 2
2006-01-01                 2

    policy_state
OH           249
IL           237
IN           214

          policy_csl
100/300          259
250/500          248
500/1000         193

      policy_deductable
1000                250
500                 231
2000                219

         policy_annual_premium
1281.25                      2
1362.87                      2
1389.13                      2
1074.07                      2
1073.83                      2
1558.29                      2
1453.61                      1
1618.65                      1
1927.87                      1
1135.43                      1

          umbrella_limit
0                    557
6000000               38
5000000               34
4000000               28
7000000               21
3000000                8
8000000                7
2000000                3
9000000                2
10000000               1

        insured_zip
431202            2
450947            1
455689            1
607605            1
605408            1
475407            1
609317            1
442604            1
453193            1
445120            1

        insured_sex
FEMALE          370
MALE            330

             insured_education_level
JD                               120
High School                      105
Associate                        105
Masters                           99
MD                                93
College                           91
PhD                               87

                   insured_occupation
machine-op-inspct                  66
exec-managerial                    57
craft-repair                       54
sales                              54
prof-specialty                     53
priv-house-serv                    52
armed-forces                       51
transport-moving                   50
tech-support                       50
other-service                      47

                insured_hobbies
exercise                     45
bungie-jumping               44
golf                         42
movies                       41
polo                         41
paintball                    40
kayaking                     38
yachting                     38
reading                      38
camping                      38

                insured_relationship
own-child                        130
other-relative                   126
husband                          125
not-in-family                    123
wife                             105
unmarried                         91

       capital-gains
0                347
51500              4
46300              4
51400              3
46700              3
38600              3
37900              3
59600              3
63600              3
67800              3

        capital-loss
 0               343
-31400             4
-61400             4
-51000             4
-53800             4
-49400             3
-49200             3
-50300             3
-50000             3
-45800             3

            incident_date
2015-02-02             21
2015-01-24             17
2015-01-07             17
2015-02-04             17
2015-02-17             16
2015-01-21             16
2015-01-08             16
2015-02-23             16
2015-01-19             16
2015-01-09             15

                          incident_type
Multi-vehicle Collision             302
Single Vehicle Collision            275
Vehicle Theft                        68
Parked Car                           55

                 collision_type
Rear Collision              208
Side Collision              194
Front Collision             175
?                           123

                incident_severity
Minor Damage                  237
Major Damage                  200
Total Loss                    199
Trivial Damage                 64

           authorities_contacted
Police                       199
Fire                         153
Ambulance                    145
Other                        143
None                          60

    incident_state
NY             187
SC             178
WV             149
NC              78
VA              69
PA              21
OH              18

             incident_city
Springfield            117
Arlington              110
Columbus               108
Northbend               96
Hillsdale               96
Riverwood               90
Northbrook              83

                         incident_location
7082 Oak Ridge                           1
5663 Oak Lane                            1
2376 Sky Ridge                           1
3900 Texas St                            1
8809 Flute St                            1
2651 MLK Lane                            1
6260 5th Lane                            1
9633 MLK Lane                            1
3799 Embaracadero Drive                  1
3246 Britain Ridge                       1

    incident_hour_of_the_day
17                        38
3                         36
23                        36
4                         35
0                         35
16                        35
13                        34
10                        32
14                        31
21                        31

   number_of_vehicles_involved
1                          398
3                          251
4                           28
2                           23

     property_damage
?                259
NO               223
YES              218

   bodily_injuries
0              236
2              232
1              232

   witnesses
1        181
0        177
2        173
3        169

     police_report_available
?                        247
NO                       236
YES                      217

       total_claim_amount
75400                   4
2640                    4
57700                   3
77440                   3
4320                    3
79800                   3
46200                   3
84590                   3
4950                    3
58300                   3

       injury_claim
0                19
480               7
780               5
640               5
900               4
860               4
5540              4
680               4
9880              3
13520             3

       property_claim
0                  14
480                 4
640                 4
11080               4
860                 4
660                 4
680                 4
840                 4
6620                4
8400                3

       vehicle_claim
5040               6
44800              5
3600               5
33600              5
3360               4
25200              3
2940               3
46000              3
4340               3
4720               3

            auto_make
Suburu             57
Nissan             56
Saab               56
Toyota             55
Chevrolet          54
Volkswagen         54
Audi               51
Ford               49
Dodge              49
BMW                48

            auto_model
Wrangler            31
RAM                 29
A3                  28
Passat              28
Jetta               26
A5                  23
Legacy              23
Pathfinder          23
MDX                 23
Forrestor           22

      auto_year
1995         42
2002         41
2009         40
2006         38
2005         38
2003         36
2013         36
1999         36
2000         35
2011         34

   fraud_reported
0             519
1             181

We drop the following columns:
- `policy_number`: since it constitutes an ID
- `incident_location`: the incident may have happened at the same address in a different city or US state 
- `insured_hobbies`: it is a detail of dubious relevance at a very high level of granularity, we keep the rest of the information about the customer (education, occupation)
- potentially, the columns policy_state, insured_zip, incident_city, auto_model can be dropped using the same reasoning
- `policy_bind_date`, `incident_date`: replaced by `insurance_duration`

We turn several variables from categorical to numerical, because there is information in the order :
- `policy_csl`: {100/300, 250/500, 500/1000}, it makes more sense as a numerical variable
- `incident_severity`: {Trivial/Minor/Major Damage, Total Loss},
- `police_report_available`: NO=0, ?=1, YES=2
- `property_damage`: NO=0, ?=1, YES=2

We create the following columns:
- `insurance_duration`: expressed in days, it replaces the variables `policy_bind_date` and `incident_date`

In [6]:
df_1 = df.drop(["policy_number", "incident_location", "insured_hobbies"], axis=1)

a = pd.to_datetime(df["incident_date"], yearfirst=True)
b = pd.to_datetime(df["policy_bind_date"], yearfirst=True)
policy_time = a - b
df_1["insurance_duration"] = policy_time
df_1 = df_1.drop(["incident_date", "policy_bind_date"], axis=1)

df_1 = df_1.replace({"policy_csl": {"100/300": 1, "250/500": 2, "500/1000": 3},
                     "incident_severity": {"Trivial Damage": 0, "Minor Damage": 1, "Major Damage": 2, "Total Loss": 3},
                     "police_report_available": {"NO": 0, "?": 1, "YES": 2},
                     "property_damage": {"NO": 0, "?": 1, "YES": 2}})

In [7]:
df

,months_as_customer,age,policy_number,policy_bind_date,policy_state,policy_csl,policy_deductable,policy_annual_premium,umbrella_limit,insured_zip,...,witnesses,police_report_available,total_claim_amount,injury_claim,property_claim,vehicle_claim,auto_make,auto_model,auto_year,fraud_reported
0,187,37,125591,2013-08-08,IN,500/1000,1000,1412.06,5000000,450947,...,3,?,57700,5770,5770,46160,Nissan,Maxima,2000,0
1,243,44,967713,1997-12-25,IL,250/500,500,809.11,0,600208,...,1,YES,51400,5140,10280,35980,Honda,Civic,1996,0
2,24,33,649082,1996-01-19,IL,500/1000,1000,1922.84,0,431277,...,1,NO,46800,4680,9360,32760,Jeep,Wrangler,2002,0
3,215,42,519312,2008-10-28,OH,500/1000,500,1848.81,0,435489,...,2,YES,68520,11420,5710,51390,Suburu,Legacy,2003,1
4,85,30,190588,2001-12-09,OH,100/300,1000,796.35,0,614166,...,1,YES,58960,5360,10720,42880,Ford,F150,2004,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
695,199,37,982871,1997-07-27,IN,250/500,500,1262.08,0,474615,...,3,NO,60170,10940,10940,38290,Nissan,Pathfinder,2011,1
696,232,43,751905,2001-05-16,OH,250/500,500,1483.91,8000000,431531,...,1,?,70600,7060,14120,49420,Volkswagen,Passat,2013,1
697,215,37,761189,2002-12-28,IN,100/300,500,1632.93,0,614417,...,0,YES,57120,9520,4760,42840,Mercedes,C300,2002,0
698,270,44,701521,2003-07-05,IL,500/1000,2000,1030.95,0,435985,...,0,NO,35900,7180,3590,25130,Audi,A3,2007,1
699,269,45,596298,1996-08-23,IN,500/1000,500,1330.46,0,435552,...,0,NO,24200,2200,4400,17600,Suburu,Forrestor,2008,0

In [8]:
df_1

,months_as_customer,age,policy_state,policy_csl,policy_deductable,policy_annual_premium,umbrella_limit,insured_zip,insured_sex,insured_education_level,...,police_report_available,total_claim_amount,injury_claim,property_claim,vehicle_claim,auto_make,auto_model,auto_year,fraud_reported,policy_duration
0,187,37,IN,3,1000,1412.06,5000000,450947,FEMALE,Masters,...,?,57700,5770,5770,46160,Nissan,Maxima,2000,0,526 days
1,243,44,IL,2,500,809.11,0,600208,MALE,JD,...,YES,51400,5140,10280,35980,Honda,Civic,1996,0,6242 days
2,24,33,IL,3,1000,1922.84,0,431277,FEMALE,High School,...,NO,46800,4680,9360,32760,Jeep,Wrangler,2002,0,6945 days
3,215,42,OH,3,500,1848.81,0,435489,MALE,JD,...,YES,68520,11420,5710,51390,Suburu,Legacy,2003,1,2292 days
4,85,30,OH,1,1000,796.35,0,614166,FEMALE,MD,...,YES,58960,5360,10720,42880,Ford,F150,2004,0,4821 days
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
695,199,37,IN,2,500,1262.08,0,474615,MALE,JD,...,NO,60170,10940,10940,38290,Nissan,Pathfinder,2011,1,6374 days
696,232,43,OH,2,500,1483.91,8000000,431531,MALE,College,...,?,70600,7060,14120,49420,Volkswagen,Passat,2013,1,4995 days
697,215,37,IN,1,500,1632.93,0,614417,FEMALE,College,...,YES,57120,9520,4760,42840,Mercedes,C300,2002,0,4440 days
698,270,44,IL,3,2000,1030.95,0,435985,FEMALE,Associate,...,NO,35900,7180,3590,25130,Audi,A3,2007,1,4231 days
699,269,45,IN,3,500,1330.46,0,435552,FEMALE,High School,...,NO,24200,2200,4400,17600,Suburu,Forrestor,2008,0,6722 days